In [3]:
import pandas as pd

In [4]:
people = {
    'first' : ['Corey','Jone','Jake'],
    'last' : ['Schafer','Doe','Doe'],
    'email' : ['CoreyMSchafer@gmail.com','JaneDoe@email.com','Jphn']
    
}

In [5]:
df = pd.DataFrame(people)

In [6]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jone      Doe        JaneDoe@email.com
2   Jake      Doe                     Jphn

In [7]:
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jone Doe
2         Jake Doe
dtype: object

In [10]:
#creating a new column and adding it's data to all existing rows
df['full_name'] = df['first'] + ' ' + df['last']

In [9]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jone      Doe        JaneDoe@email.com       Jone Doe
2   Jake      Doe                     Jphn       Jake Doe

In [13]:
df.drop(columns=['first','last'],inplace=True)

In [15]:
df[['first','last']] = df['full_name'].str.split(' ',expand=True)

In [16]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jone Doe   Jone      Doe
2                     Jphn       Jake Doe   Jake      Doe

In [18]:
df.drop(columns=['full_name'],inplace=True)

In [19]:
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jone      Doe
2                     Jphn   Jake      Doe

In [20]:
people2= {
    'first': ['Tony', 'Steve'], 
    'last': ['Stark', 'Rogers'], 
    'email': ['IronMan@avenge.com', 'Cap@avenge.com']
}

In [22]:
df2= pd.DataFrame(people2)

In [23]:
df.append(df2,ignore_index=True)

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jone      Doe
2                     Jphn   Jake      Doe
3       IronMan@avenge.com   Tony    Stark
4           Cap@avenge.com  Steve   Rogers

In [1]:
df.drop(axis=1,index=4)

NameError: name 'df' is not defined